tutorials/conjugateHeatTransfer/coolingSphere/constant/regionInterfacePropertiesPartitioned
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionInterfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

partitionedCoupledPatches
(
    fluidsolid
    {
        interfaceType heatTransferInterface;

        coupledPatchPair
        (
            (fluid fluid_to_solid)
            (solid solid_to_fluid)
        );

        coupledFields
        (
            T
        );

        heatTransferInterfaceCoeffs
        {
            // Jump coefficient
            K               K [ 0 0 0 0 0 0 0 ] 1;
        }
    }
);

monolithicCoupledPatches
(
);

curvatureCorrectedSurfacePatches 0();

interpolatorUpdateFrequency 1;

interfaceTransferMethod GGI;

directMapCoeffs
{}

GGICoeffs
{}

// ************************************************************************* //
